renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_sdc_sdmem_rx/src/mem/r_sdc_sdmem_read.c
/**********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No 
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all 
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, 
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM 
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES 
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of 
* this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer 
*
* Copyright (C) 2014(2015-2017) Renesas Electronics Corporation. All rights reserved.    
**********************************************************************************************************************/
/**********************************************************************************************************************
* System Name  : SDHI Driver
* File Name    : r_sdc_sdmem_read.c
* Version      : 2.00
* Device       : RX
* Abstract     : API & Sub module
* Tool-Chain   : For RX e2_studio
* OS           : not use
* H/W Platform : RSK board for RX
* Description  : Interface file for SDC SD API for RX
* Limitation   : None
**********************************************************************************************************************/
/**********************************************************************************************************************
* History      : DD.MM.YYYY Version Description
*              : 05.09.2014 1.00    First Release
*              : 17.07.2015 1.10    Standardized by the combo.
*              : 31.07.2017 2.00    SDHI FIT module separated into hardware low level layer and middleware layer.
*              :                    Changed prefix from SDHI to SDC_SD.
**********************************************************************************************************************/

/**********************************************************************************************************************
Includes <System Includes> , "Project Includes"
**********************************************************************************************************************/
#include "r_sdc_sd_rx_if.h"
#include ".\src\r_sdc_sd_rx_private.h"

#if (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM)

/**********************************************************************************************************************
Macro definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Typedef definitions
**********************************************************************************************************************/

/**********************************************************************************************************************
Private global variables and functions
**********************************************************************************************************************/
static sdc_sd_status_t r_sdc_sdmem_read_sect(uint32_t card_no, sdc_sd_access_t * p_sdc_sd_access);
static sdc_sd_status_t r_sdc_sdmem_read_sect_sub(uint32_t card_no, sdc_sd_access_t * p_sdc_sd_access);

/**********************************************************************************************************************
* Outline      : Read Data from SD Memory
* Function Name: r_sdc_sdmem_Read
* Description  : Reads the data from the SD Memory.
* Arguments    : uint32_t           card_no             ;   SD Card No.
*              : sdc_sd_access_t  * p_sdc_sd_access     ;   SDHI Driver transfer configuration
* Return Value : SDC_SD_SUCCESS                         ;   Successful operation
*              : other                                  ;   Failed operation
*----------------------------------------------------------------------------------------------------------------------
* Notes        : None
**********************************************************************************************************************/
sdc_sd_status_t r_sdc_sdmem_Read(uint32_t card_no, sdc_sd_access_t * p_sdc_sd_access)
{
    sdc_sd_hndl_t * p_hndl = 0;

    if (SDC_SD_ERR == r_sdc_sdmem_chk_param(card_no, p_sdc_sd_access))
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
        return SDC_SD_ERR;
    }

    p_hndl = SDC_SD_GET_HNDL(card_no);

    /* ---- Check the buffer boundary (4-byte unit). ---- */
    if (0 != ((uint32_t)p_sdc_sd_access->p_buff & SDC_SD_ADDR_BOUNDARY))
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_ADDRESS_BOUNDARY);
        return SDC_SD_ERR_ADDRESS_BOUNDARY;
    }

#if defined(SDC_SD_CFG_FREE_LIB)
    /* ---- Check access area. ---- */
    if ((p_sdc_sd_access->lbn >= SDC_SD_SIZE_CARD_1024MB) ||
        ((p_sdc_sd_access->lbn + p_sdc_sd_access->cnt) > SDC_SD_SIZE_CARD_1024MB))
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR);
        return SDC_SD_ERR; /* Out of area */
    }
#endif /* SDC_SD_CFG_FREE_LIB */

    /* ---- Check the card is mounted. ---- */
    if (SDC_SD_MOUNT_UNLOCKED_CARD != p_hndl->mount)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR);
        return SDC_SD_ERR;
    }

    p_hndl->error = SDC_SD_SUCCESS;

    /* ---- Check the stop flag. ---- */
    if (p_hndl->stop)
    {
        p_hndl->stop = 0;
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_STOP);
        return SDC_SD_ERR_STOP;
    }

    /* ---- Check the card insertion. ---- */
    if (R_SDC_SD_GetCardDetection(card_no) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_NO_CARD);
        return SDC_SD_ERR_NO_CARD;
    }

    /* ---- Check the cnt, and set mode to PIO/DMA/DTC transfer. ---- */
    if (p_hndl->trans_mode & SDC_SD_MODE_DMA)
    {
        if (2 == p_sdc_sd_access->cnt)
        {
            p_sdc_sd_access->mode = SDC_SD_MODE_SW;
        }
        else
        {
            p_sdc_sd_access->mode = SDC_SD_MODE_DMA;
        }
    }
    else if (p_hndl->trans_mode & SDC_SD_MODE_DTC)
    {
        if (2 == p_sdc_sd_access->cnt)
        {
            p_sdc_sd_access->mode = SDC_SD_MODE_SW;
        }
        else
        {
            p_sdc_sd_access->mode = SDC_SD_MODE_DTC;
        }
    }
    else
    {
        p_sdc_sd_access->mode = SDC_SD_MODE_SW;
    }

    /* ---- Supply the clock for data-transfer mode. ---- */
    if (R_SDHI_SetClock(p_hndl->channel, p_hndl->mem_tran_speed, SDHI_CLOCK_ENABLE) == SDHI_SUCCESS)
    {
        r_sdc_sd_disable_icu_int(card_no);
        r_sdc_sd_clear_int_mask(card_no, SDHI_SDIMSK1_TRNS_RESP, SDHI_SDIMSK2_CLEAR);
        R_SDHI_ClearSdstsReg(p_hndl->channel, SDHI_SDIMSK1_TRNS_RESP, SDHI_SDIMSK2_CLEAR);
        r_sdc_sd_clear_sdsts(card_no, SDHI_SDIMSK1_TRNS_RESP, SDHI_SDIMSK2_CLEAR);
        r_sdc_sd_enable_icu_int(card_no);

        /* ==== Read data from the SD Memory card. ==== */
        r_sdc_sdmem_read_sect(card_no, p_sdc_sd_access);

