renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_sdc_sdmem_rx/src/mem/r_sdc_sdmem_read.c
    if ((SDC_SD_MODE_SW == p_sdc_sd_access->mode) || (SDC_SD_MODE_SW_SINGLE == p_sdc_sd_access->mode))
    {
        /* Enable All end, BRE and errors. */
        r_sdc_sd_disable_icu_int(card_no);
        r_sdc_sd_set_int_mask(card_no, SDHI_SDIMSK1_DATA_TRNS, SDHI_SDIMSK2_BRE);
        r_sdc_sd_enable_icu_int(card_no);
        /* PIO */
        ret = r_sdc_sd_software_trans(card_no, p_sdc_sd_access->p_buff, p_sdc_sd_access->cnt, SDC_SD_TRANS_READ);
    } 
    else    /* ==== DMA or DTC ==== */
    {
        /* Disable card ins&rem interrupt. */
        r_sdc_sd_disable_icu_int(card_no);
        sdsts1_back = (uint32_t)(p_hndl->sdimsk1 & SDHI_SDIMSK1_DET_CD);
        r_sdc_sd_clear_int_mask(card_no, SDHI_SDIMSK1_DET_CD, 0);
        /* Enable All errors. */
        r_sdc_sd_set_int_mask(card_no, 0, SDHI_SDIMSK2_ERR);
        r_sdc_sd_enable_icu_int(card_no);

        /* DMA or DTC  */
        ret = r_sdc_sd_dmacdtc_trans(card_no, p_sdc_sd_access->cnt);

        /* Disable the DMA/DTC. */
        R_SDHI_InReg(p_hndl->channel, SDHI_SDDMAEN, &sdhi_sddma_ctrl);
        sdhi_sddma_ctrl = (uint32_t)(sdhi_sddma_ctrl & (~SDHI_SDDMAEN_DMASDRW));
        R_SDHI_OutReg(p_hndl->channel, SDHI_SDDMAEN, sdhi_sddma_ctrl);
        r_sdc_sd_disable_icu_int(card_no);
        r_sdc_sd_set_int_mask(card_no, (sdsts1_back | SDHI_SDIMSK1_DATA_TRNS), 0);
        r_sdc_sd_enable_icu_int(card_no);
    }

    if (SDC_SD_SUCCESS != ret)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
        return p_hndl->error;
    }

    /* ---- Wait All end interrupt. ---- */
    if (r_sdc_sd_int_mem_wait(card_no, SDC_SD_TIMEOUT_RESP) != SDC_SD_SUCCESS)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
        r_sdc_sd_set_err(card_no, SDC_SD_ERR_HOST_TOE);
        r_sdc_sdmem_read_write_error(card_no);
        return p_hndl->error;
    }

    /* ---- Check errors. ---- */
    if (p_hndl->sdsts2 & SDHI_SDIMSK2_ERR)
    {
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
        r_sdc_sd_check_sdsts2_err(card_no);
        r_sdc_sdmem_read_write_error(card_no);
        return p_hndl->error;
    }

    /* Disable All end, BRE and errors. */
    r_sdc_sd_disable_icu_int(card_no);
    r_sdc_sd_clear_int_mask(card_no, SDHI_SDIMSK1_DATA_TRNS, SDHI_SDIMSK2_BRE);
    r_sdc_sd_enable_icu_int(card_no);

    /* Clear All end bits. */
    r_sdc_sd_clear_sdsts(card_no, SDHI_SDIMSK1_DATA_TRNS, 0);

    /* ==== Check the status after read operation. ==== */
    if (r_sdc_sd_send_cmd_arg(card_no, SDC_SD_CMD13, SDC_SD_RESP_R1, p_hndl->rca[0]) != SDC_SD_SUCCESS)
    {
        /* Check OUT_OF_RANGE error. */
        /* Ignore errors during the last block access. */
        if (p_hndl->resp_status & SDC_SD_RES_ERR)
        {
            if ((p_sdc_sd_access->lbn + p_sdc_sd_access->cnt) != p_hndl->card_sector_size)
            {
                /* Not last block */
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
                r_sdc_sdmem_read_write_error(card_no);
                return p_hndl->error;
            }
            if (p_hndl->resp_status & SDC_SD_RES_ERR_IGNORE_OUT_OF_RAGE)
            {
                /* Not OUT_OF_RANGE error */
                SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
                r_sdc_sdmem_read_write_error(card_no);
                return p_hndl->error;
            }
            /* Clear OUT_OF_RANGE error. */
            p_hndl->resp_status = (p_hndl->resp_status & (SDC_SD_RES_STATE | SDC_SD_RES_READY_FOR_DATA));
            p_hndl->error = SDC_SD_SUCCESS;
        }
        else    /* SDHI error, ex)timeout error so on */
        {
            SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
            r_sdc_sdmem_read_write_error(card_no);
            return p_hndl->error;
        }
    }

    if (SDC_SD_STATE_TRAN != (p_hndl->resp_status & SDC_SD_RES_STATE))  /* Not in transfer state */
    {
        p_hndl->error = SDC_SD_ERR;
        SDC_SD_LOG_FUNC(SDC_SD_DEBUG_ERR_ID, (uint32_t)SDC_SDMEM_READ, __LINE__);
        r_sdc_sdmem_read_write_error(card_no);
        return p_hndl->error;
    }

    return p_hndl->error;
} /* End of function r_sdc_sdmem_read_sect_sub() */
#endif /* (SDC_SD_CFG_DRIVER_MODE & SDC_SD_MODE_MEM) */

/* End of File */
